#+TITLE: TensorFlow Tutorial #19
*** Imports
#+BEGIN_SRC ipython :session :exports both :async t :results raw drawer
  # %matplotlib inline
  import matplotlib.pyplot as plt
  import tensorflow as tf
  import numpy as np
  import math
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[1]:
:END:

 /home/magnus/anaconda3/envs/tf-test/lib/python3.6/importlib/_bootstrap.py:205: RuntimeWarning: compiletime version 3.5 of module 'tensorflow.python.framework.fast_tensor_util' does not match runtime version 3.6
   return f(*args, **kwds)

 We need to import several things from Keras.

#+BEGIN_SRC ipython :session :exports both :async t :results raw drawer
 # from tf.keras.models import Sequential  # This does not work!
 from tensorflow.python.keras import backend as K
 from tensorflow.python.keras.models import Sequential
 from tensorflow.python.keras.layers import InputLayer, Input
 from tensorflow.python.keras.layers import Reshape, MaxPooling2D
 from tensorflow.python.keras.layers import Conv2D, Dense, Flatten
 from tensorflow.python.keras.callbacks import TensorBoard
 from tensorflow.python.keras.optimizers import Adam
 from tensorflow.python.keras.models import load_model
#+END_SRC

#+RESULTS:
:RESULTS:
# Out[2]:
:END:

NOTE: We will save and load models using Keras so you need to have h5py
installed. You also need to have scikit-optimize installed for doing the
hyper-parameter optimization.

 You should be able to run the following command in a terminal to install them
 both:

 #+BEGIN_QUOTE
 pip install h5py scikit-optimize
 #+END_QUOTE

 NOTE: This Notebook requires plotting functions in scikit-optimize that have
 not been merged into the official release at the time of this writing. If this
 Notebook cannot run with the version of scikit-optimize installed by the
 command above, you may have to install scikit-optimize from a development
 branch by running the following command instead:

 #+BEGIN_QUOTE
 pip install
 git+git://github.com/Hvass-Labs/scikit-optimize.git@dd7433da068b5a2509ef4ea4e5195458393e6555
 #+END_QUOTE


 #+BEGIN_SRC ipython :session :exports both :async t :results raw drawer
 import skopt
 from skopt import gp_minimize, forest_minimize
 from skopt.space import Real, Categorical, Integer
 from skopt.plots import plot_convergence
 from skopt.plots import plot_objective, plot_evaluations
 from skopt.plots import plot_histogram, plot_objective_2D
 from skopt.utils import use_named_args
 #+END_SRC

 #+RESULTS:
 :RESULTS:
 0 - 21100f9a-75ef-418e-a302-4a1905d009aa
 :END:

 This was developed using Python 3.6 (Anaconda) and package versions:

#+BEGIN_SRC ipython :session :exports both :async t :results raw drawer
 tf.__version__
#+END_SRC
 '1.4.0'

#+BEGIN_SRC ipython :session :exports both :async t :results raw drawer
 tf.keras.__version__
#+END_SRC
 '2.0.8-tf'

 #+BEGIN_SRC ipython :session :exports both :async t :results raw drawer
 skopt.__version__
 #+END_SRC
 '0.4'

